; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    (can_traverse ?x ?y ?z)
    (at ?x ?y)
    (visible ?y ?z))
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=4, waypoints=10, cameras=4, objectives=10, out_folder=training/easy, instance_id=99, seed=134

(define (problem rover-99)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 objective9 objective10 - objective)
 (:init 
    (at_lander general waypoint8)
    (at rover1 waypoint9)
    (at rover2 waypoint4)
    (at rover3 waypoint9)
    (at rover4 waypoint3)
    (equipped_for_soil_analysis rover4)
    (equipped_for_rock_analysis rover3)
    (equipped_for_rock_analysis rover2)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover4)
    (equipped_for_imaging rover3)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint9)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint5)
    (at_soil_sample waypoint7)
    (at_soil_sample waypoint8)
    (at_soil_sample waypoint9)
    (at_soil_sample waypoint10)
    (visible waypoint7 waypoint4)
    (visible waypoint4 waypoint10)
    (visible waypoint1 waypoint3)
    (visible waypoint5 waypoint8)
    (visible waypoint3 waypoint1)
    (visible waypoint10 waypoint4)
    (visible waypoint1 waypoint9)
    (visible waypoint6 waypoint1)
    (visible waypoint5 waypoint7)
    (visible waypoint1 waypoint4)
    (visible waypoint8 waypoint5)
    (visible waypoint8 waypoint2)
    (visible waypoint1 waypoint6)
    (visible waypoint7 waypoint5)
    (visible waypoint9 waypoint1)
    (visible waypoint4 waypoint1)
    (visible waypoint4 waypoint7)
    (visible waypoint2 waypoint8)
    (visible waypoint2 waypoint7)
    (visible waypoint7 waypoint2)
    (visible waypoint3 waypoint6)
    (visible waypoint6 waypoint3)
    (visible waypoint3 waypoint9)
    (visible waypoint9 waypoint3)
    (visible waypoint2 waypoint6)
    (visible waypoint6 waypoint2)
    (visible waypoint4 waypoint8)
    (visible waypoint8 waypoint4)
    (visible waypoint9 waypoint10)
    (visible waypoint10 waypoint9)
    (visible waypoint3 waypoint7)
    (visible waypoint7 waypoint3)
    (visible waypoint6 waypoint10)
    (visible waypoint10 waypoint6)
    (visible waypoint3 waypoint10)
    (visible waypoint10 waypoint3)
    (visible waypoint1 waypoint7)
    (visible waypoint7 waypoint1)
    (visible waypoint1 waypoint5)
    (visible waypoint5 waypoint1)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint5 waypoint10)
    (visible waypoint10 waypoint5)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint3 waypoint5)
    (visible waypoint5 waypoint3)
    (visible waypoint7 waypoint8)
    (visible waypoint8 waypoint7)
    (visible waypoint2 waypoint10)
    (visible waypoint10 waypoint2)
    (visible waypoint8 waypoint9)
    (visible waypoint9 waypoint8)
    (visible waypoint6 waypoint8)
    (visible waypoint8 waypoint6)
    (visible waypoint5 waypoint6)
    (visible waypoint6 waypoint5)
    (visible waypoint1 waypoint8)
    (visible waypoint8 waypoint1)
    (visible waypoint4 waypoint9)
    (visible waypoint9 waypoint4)
    (visible waypoint3 waypoint8)
    (visible waypoint8 waypoint3)
    (visible waypoint6 waypoint7)
    (visible waypoint7 waypoint6)
    (visible waypoint5 waypoint9)
    (visible waypoint9 waypoint5)
    (visible waypoint6 waypoint9)
    (visible waypoint9 waypoint6)
    (visible waypoint4 waypoint5)
    (visible waypoint5 waypoint4)
    (visible waypoint7 waypoint9)
    (visible waypoint9 waypoint7)
    (visible waypoint2 waypoint3)
    (visible waypoint3 waypoint2)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint2 waypoint4)
    (visible waypoint4 waypoint2)
    (visible waypoint8 waypoint10)
    (visible waypoint10 waypoint8)
    (can_traverse rover1 waypoint7 waypoint4)
    (can_traverse rover1 waypoint4 waypoint10)
    (can_traverse rover1 waypoint1 waypoint3)
    (can_traverse rover1 waypoint5 waypoint8)
    (can_traverse rover1 waypoint3 waypoint1)
    (can_traverse rover1 waypoint10 waypoint4)
    (can_traverse rover1 waypoint1 waypoint9)
    (can_traverse rover1 waypoint6 waypoint1)
    (can_traverse rover1 waypoint5 waypoint7)
    (can_traverse rover1 waypoint1 waypoint4)
    (can_traverse rover1 waypoint8 waypoint5)
    (can_traverse rover1 waypoint8 waypoint2)
    (can_traverse rover1 waypoint1 waypoint6)
    (can_traverse rover1 waypoint7 waypoint5)
    (can_traverse rover1 waypoint9 waypoint1)
    (can_traverse rover1 waypoint4 waypoint1)
    (can_traverse rover1 waypoint4 waypoint7)
    (can_traverse rover1 waypoint2 waypoint8)
    (can_traverse rover1 waypoint2 waypoint7)
    (can_traverse rover1 waypoint7 waypoint2)
    (can_traverse rover1 waypoint2 waypoint6)
    (can_traverse rover1 waypoint6 waypoint2)
    (can_traverse rover1 waypoint4 waypoint8)
    (can_traverse rover1 waypoint8 waypoint4)
    (can_traverse rover1 waypoint1 waypoint5)
    (can_traverse rover1 waypoint5 waypoint1)
    (can_traverse rover1 waypoint1 waypoint2)
    (can_traverse rover1 waypoint2 waypoint1)
    (can_traverse rover1 waypoint2 waypoint10)
    (can_traverse rover1 waypoint10 waypoint2)
    (can_traverse rover1 waypoint8 waypoint9)
    (can_traverse rover1 waypoint9 waypoint8)
    (can_traverse rover1 waypoint5 waypoint6)
    (can_traverse rover1 waypoint6 waypoint5)
    (can_traverse rover2 waypoint7 waypoint4)
    (can_traverse rover2 waypoint4 waypoint10)
    (can_traverse rover2 waypoint1 waypoint3)
    (can_traverse rover2 waypoint5 waypoint8)
    (can_traverse rover2 waypoint3 waypoint1)
    (can_traverse rover2 waypoint10 waypoint4)
    (can_traverse rover2 waypoint1 waypoint9)
    (can_traverse rover2 waypoint6 waypoint1)
    (can_traverse rover2 waypoint5 waypoint7)
    (can_traverse rover2 waypoint1 waypoint4)
    (can_traverse rover2 waypoint8 waypoint5)
    (can_traverse rover2 waypoint8 waypoint2)
    (can_traverse rover2 waypoint1 waypoint6)
    (can_traverse rover2 waypoint7 waypoint5)
    (can_traverse rover2 waypoint9 waypoint1)
    (can_traverse rover2 waypoint4 waypoint1)
    (can_traverse rover2 waypoint4 waypoint7)
    (can_traverse rover2 waypoint2 waypoint8)
    (can_traverse rover2 waypoint3 waypoint7)
    (can_traverse rover2 waypoint7 waypoint3)
    (can_traverse rover2 waypoint3 waypoint10)
    (can_traverse rover2 waypoint10 waypoint3)
    (can_traverse rover2 waypoint5 waypoint10)
    (can_traverse rover2 waypoint10 waypoint5)
    (can_traverse rover2 waypoint2 waypoint10)
    (can_traverse rover2 waypoint10 waypoint2)
    (can_traverse rover2 waypoint8 waypoint9)
    (can_traverse rover2 waypoint9 waypoint8)
    (can_traverse rover2 waypoint4 waypoint9)
    (can_traverse rover2 waypoint9 waypoint4)
    (can_traverse rover2 waypoint6 waypoint7)
    (can_traverse rover2 waypoint7 waypoint6)
    (can_traverse rover2 waypoint6 waypoint9)
    (can_traverse rover2 waypoint9 waypoint6)
    (can_traverse rover2 waypoint2 waypoint4)
    (can_traverse rover2 waypoint4 waypoint2)
    (can_traverse rover2 waypoint8 waypoint10)
    (can_traverse rover2 waypoint10 waypoint8)
    (can_traverse rover3 waypoint7 waypoint4)
    (can_traverse rover3 waypoint4 waypoint10)
    (can_traverse rover3 waypoint1 waypoint3)
    (can_traverse rover3 waypoint5 waypoint8)
    (can_traverse rover3 waypoint3 waypoint1)
    (can_traverse rover3 waypoint10 waypoint4)
    (can_traverse rover3 waypoint1 waypoint9)
    (can_traverse rover3 waypoint6 waypoint1)
    (can_traverse rover3 waypoint5 waypoint7)
    (can_traverse rover3 waypoint1 waypoint4)
    (can_traverse rover3 waypoint8 waypoint5)
    (can_traverse rover3 waypoint8 waypoint2)
    (can_traverse rover3 waypoint1 waypoint6)
    (can_traverse rover3 waypoint7 waypoint5)
    (can_traverse rover3 waypoint9 waypoint1)
    (can_traverse rover3 waypoint4 waypoint1)
    (can_traverse rover3 waypoint4 waypoint7)
    (can_traverse rover3 waypoint2 waypoint8)
    (can_traverse rover3 waypoint2 waypoint6)
    (can_traverse rover3 waypoint6 waypoint2)
    (can_traverse rover3 waypoint4 waypoint8)
    (can_traverse rover3 waypoint8 waypoint4)
    (can_traverse rover3 waypoint9 waypoint10)
    (can_traverse rover3 waypoint10 waypoint9)
    (can_traverse rover3 waypoint3 waypoint5)
    (can_traverse rover3 waypoint5 waypoint3)
    (can_traverse rover3 waypoint7 waypoint8)
    (can_traverse rover3 waypoint8 waypoint7)
    (can_traverse rover3 waypoint8 waypoint9)
    (can_traverse rover3 waypoint9 waypoint8)
    (can_traverse rover3 waypoint1 waypoint8)
    (can_traverse rover3 waypoint8 waypoint1)
    (can_traverse rover3 waypoint4 waypoint9)
    (can_traverse rover3 waypoint9 waypoint4)
    (can_traverse rover3 waypoint4 waypoint5)
    (can_traverse rover3 waypoint5 waypoint4)
    (can_traverse rover3 waypoint2 waypoint4)
    (can_traverse rover3 waypoint4 waypoint2)
    (can_traverse rover4 waypoint7 waypoint4)
    (can_traverse rover4 waypoint4 waypoint10)
    (can_traverse rover4 waypoint1 waypoint3)
    (can_traverse rover4 waypoint5 waypoint8)
    (can_traverse rover4 waypoint3 waypoint1)
    (can_traverse rover4 waypoint10 waypoint4)
    (can_traverse rover4 waypoint1 waypoint9)
    (can_traverse rover4 waypoint6 waypoint1)
    (can_traverse rover4 waypoint5 waypoint7)
    (can_traverse rover4 waypoint1 waypoint4)
    (can_traverse rover4 waypoint8 waypoint5)
    (can_traverse rover4 waypoint8 waypoint2)
    (can_traverse rover4 waypoint1 waypoint6)
    (can_traverse rover4 waypoint7 waypoint5)
    (can_traverse rover4 waypoint9 waypoint1)
    (can_traverse rover4 waypoint4 waypoint1)
    (can_traverse rover4 waypoint4 waypoint7)
    (can_traverse rover4 waypoint2 waypoint8)
    (can_traverse rover4 waypoint9 waypoint10)
    (can_traverse rover4 waypoint10 waypoint9)
    (can_traverse rover4 waypoint3 waypoint10)
    (can_traverse rover4 waypoint10 waypoint3)
    (can_traverse rover4 waypoint8 waypoint9)
    (can_traverse rover4 waypoint9 waypoint8)
    (can_traverse rover4 waypoint5 waypoint9)
    (can_traverse rover4 waypoint9 waypoint5)
    (can_traverse rover4 waypoint6 waypoint9)
    (can_traverse rover4 waypoint9 waypoint6)
    (can_traverse rover4 waypoint4 waypoint5)
    (can_traverse rover4 waypoint5 waypoint4)
    (can_traverse rover4 waypoint7 waypoint9)
    (can_traverse rover4 waypoint9 waypoint7)
    (can_traverse rover4 waypoint2 waypoint3)
    (can_traverse rover4 waypoint3 waypoint2)
    (can_traverse rover4 waypoint2 waypoint5)
    (can_traverse rover4 waypoint5 waypoint2)
    (calibration_target camera1 objective4)
    (on_board camera1 rover3)
    (supports camera1 low_res)
    (supports camera1 high_res)
    (supports camera1 colour)
    (calibration_target camera2 objective5)
    (on_board camera2 rover4)
    (supports camera2 high_res)
    (supports camera2 colour)
    (supports camera2 low_res)
    (calibration_target camera3 objective8)
    (on_board camera3 rover3)
    (supports camera3 low_res)
    (calibration_target camera4 objective3)
    (on_board camera4 rover2)
    (supports camera4 colour)
    (supports camera4 high_res)
    (supports camera4 low_res)
    (visible_from objective1 waypoint6)
    (visible_from objective1 waypoint2)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint10)
    (visible_from objective1 waypoint1)
    (visible_from objective1 waypoint4)
    (visible_from objective2 waypoint4)
    (visible_from objective3 waypoint6)
    (visible_from objective3 waypoint8)
    (visible_from objective3 waypoint9)
    (visible_from objective4 waypoint1)
    (visible_from objective4 waypoint7)
    (visible_from objective4 waypoint10)
    (visible_from objective4 waypoint2)
    (visible_from objective5 waypoint5)
    (visible_from objective5 waypoint9)
    (visible_from objective5 waypoint1)
    (visible_from objective5 waypoint8)
    (visible_from objective6 waypoint9)
    (visible_from objective6 waypoint6)
    (visible_from objective6 waypoint4)
    (visible_from objective6 waypoint1)
    (visible_from objective6 waypoint10)
    (visible_from objective6 waypoint3)
    (visible_from objective7 waypoint9)
    (visible_from objective8 waypoint2)
    (visible_from objective8 waypoint8)
    (visible_from objective8 waypoint3)
    (visible_from objective8 waypoint6)
    (visible_from objective8 waypoint5)
    (visible_from objective8 waypoint4)
    (visible_from objective8 waypoint1)
    (visible_from objective8 waypoint10)
    (visible_from objective9 waypoint4)
    (visible_from objective9 waypoint9)
    (visible_from objective9 waypoint3)
    (visible_from objective9 waypoint1)
    (visible_from objective9 waypoint10)
    (visible_from objective9 waypoint7)
    (visible_from objective9 waypoint6)
    (visible_from objective9 waypoint2)
    (visible_from objective10 waypoint8)
    (visible_from objective10 waypoint3)
    (visible_from objective10 waypoint5)
    (visible_from objective10 waypoint6)
    (visible_from objective10 waypoint4)
    (visible_from objective10 waypoint10)
    (visible_from objective10 waypoint7)
    (visible_from objective10 waypoint9))
 (:goal  (and 
    
    (communicated_soil_data waypoint10)
    (communicated_soil_data waypoint7)
    (communicated_soil_data waypoint8)
    (communicated_soil_data waypoint9)
    (communicated_image_data objective9 colour)
    (communicated_image_data objective1 low_res)
    (communicated_image_data objective1 high_res)
    (communicated_image_data objective5 colour))))

; plan
1. (navigate rover4 waypoint3 waypoint10)
   deleted: (at rover4 waypoint3)
   added: (at rover4 waypoint10)
   goals met: 0 of 8
2. (sample_soil rover4 rover4store waypoint10)
   deleted: (empty rover4store) (at_soil_sample waypoint10)
   added: (full rover4store) (have_soil_analysis rover4 waypoint10)
   goals met: 0 of 8
3. (navigate rover4 waypoint10 waypoint9)
   deleted: (at rover4 waypoint10)
   added: (at rover4 waypoint9)
   goals met: 0 of 8
4. (communicate_soil_data rover4 general waypoint10 waypoint9 waypoint8)
   added: (communicated_soil_data waypoint10)
   goals met: 1 of 8
5. (navigate rover4 waypoint9 waypoint8)
   deleted: (at rover4 waypoint9)
   added: (at rover4 waypoint8)
   goals met: 1 of 8
6. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 1 of 8
7. (sample_soil rover4 rover4store waypoint8)
   deleted: (empty rover4store) (at_soil_sample waypoint8)
   added: (full rover4store) (have_soil_analysis rover4 waypoint8)
   goals met: 1 of 8
8. (navigate rover4 waypoint8 waypoint9)
   deleted: (at rover4 waypoint8)
   added: (at rover4 waypoint9)
   goals met: 1 of 8
9. (communicate_soil_data rover4 general waypoint8 waypoint9 waypoint8)
   added: (communicated_soil_data waypoint8)
   goals met: 2 of 8
10. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 2 of 8
11. (sample_soil rover4 rover4store waypoint9)
   deleted: (empty rover4store) (at_soil_sample waypoint9)
   added: (full rover4store) (have_soil_analysis rover4 waypoint9)
   goals met: 2 of 8
12. (navigate rover4 waypoint9 waypoint7)
   deleted: (at rover4 waypoint9)
   added: (at rover4 waypoint7)
   goals met: 2 of 8
13. (communicate_soil_data rover4 general waypoint9 waypoint7 waypoint8)
   added: (communicated_soil_data waypoint9)
   goals met: 3 of 8
14. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 3 of 8
15. (sample_soil rover4 rover4store waypoint7)
   deleted: (empty rover4store) (at_soil_sample waypoint7)
   added: (full rover4store) (have_soil_analysis rover4 waypoint7)
   goals met: 3 of 8
16. (communicate_soil_data rover4 general waypoint7 waypoint7 waypoint8)
   added: (communicated_soil_data waypoint7)
   goals met: 4 of 8
17. (navigate rover3 waypoint9 waypoint1)
   deleted: (at rover3 waypoint9)
   added: (at rover3 waypoint1)
   goals met: 4 of 8
18. (calibrate rover3 camera1 objective4 waypoint1)
   added: (calibrated camera1 rover3)
   goals met: 4 of 8
19. (take_image rover3 waypoint1 objective1 camera1 high_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective1 high_res)
   goals met: 4 of 8
20. (communicate_image_data rover3 general objective1 high_res waypoint1 waypoint8)
   added: (communicated_image_data objective1 high_res)
   goals met: 5 of 8
21. (calibrate rover3 camera1 objective4 waypoint1)
   added: (calibrated camera1 rover3)
   goals met: 5 of 8
22. (take_image rover3 waypoint1 objective9 camera1 colour)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective9 colour)
   goals met: 5 of 8
23. (communicate_image_data rover3 general objective9 colour waypoint1 waypoint8)
   added: (communicated_image_data objective9 colour)
   goals met: 6 of 8
24. (calibrate rover3 camera1 objective4 waypoint1)
   added: (calibrated camera1 rover3)
   goals met: 6 of 8
25. (take_image rover3 waypoint1 objective5 camera1 colour)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective5 colour)
   goals met: 6 of 8
26. (communicate_image_data rover3 general objective5 colour waypoint1 waypoint8)
   added: (communicated_image_data objective5 colour)
   goals met: 7 of 8
27. (calibrate rover3 camera1 objective4 waypoint1)
   added: (calibrated camera1 rover3)
   goals met: 7 of 8
28. (take_image rover3 waypoint1 objective1 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective1 low_res)
   goals met: 7 of 8
29. (communicate_image_data rover3 general objective1 low_res waypoint1 waypoint8)
   added: (communicated_image_data objective1 low_res)
   goals met: 8 of 8
